{
	"name": "RBMK Console",
	"icon": ["hbm:tile.rbmk_console", 1, 0],
	"trigger": [["hbm:tile.rbmk_console"]],
	"title": {
		"en_US": "RBMK Console",
		"zh_CN": "RBMK石墨式反应堆控制台"
	},
	"content": {
		"en_US": "The RBMK console allows monitoring and control over an [[RBMK]] over a 15x15 block area. While technically optional, it is usually an important part in most successful RBMKs. To use the console, shift-click the central position of the RBMK with an RBMK linker, then shift-click the console.<br><br>The console has a display that shows fuel status and component heat as part of its model, this alone allows the reactor's status to be determined easily from afar, even without using the GUI. In addition, the console has six displays which can be configured to show various infos. To configure, open the GUI, select the columns that should be monitored, click the \"Assign selected columns\" button, and then click on the monitor type button until it shows the desired info.<br><br>On the bottom, the console's GUI also shows a graph of the total neutron flux that is being detected by the [[fuel channels|RBMK Fuel Channel]], making it easy to detect changes such as a drop in reaction due to fuel depletion or hazardous reaction spikes.<br><br>In the center, there are colored buttons which can quickly select all [[control rods|RBMK Control Rods]] in that color group with left click, or assign all selected control rods a color group with right click. In addition, there is a small text field that can set the control rod extraction level of all selected control rods. Finally, the small white/red gradient button allows to cycle between the compression settions on selected [[steam channels|RBMK Steam Channel]].",
		"zh_CN": "RBMK石墨式反应堆控制台可以监测并控制15x15方块范围内的[[RBMK]] 反应堆部件。RBMK控制台在技术上不是必需的，但通常是绝大多数成功的 RBMK的重要组成部分。要使用RBMK控制台，需要先用RBMK连接装置 潜行右击反应堆的中心位置，再潜行右击控制台。<br><br>控制台的模型上具有一个显示燃料状态和反应堆部件温度的屏幕，这个屏幕使 反应堆的状态可以很容易地从远处监测，甚至完全不用打开GUI就能做到。 此外，控制台还含有六个可以显示多种信息的屏幕，其显示内容可以配置；若 要配置其显示内容，则需要打开GUI并选择需要监测的柱体，之后点击“绑 定所选柱体”按钮，再点击检测项目按钮，直到出现想要的内容。<br><br>控制台GUI底部还有一个显示[[燃料通道|RBMK Fuel Channel]]检测到的总中子通量的图表，通 过这个图表可以很容易监测到燃料消耗导致的反应剧烈程度下降，或是危险的 中子通量激增。<br><br>对GUI中部的彩色按钮点击左键，可以选择所有相应颜色的[[控制棒|RBMK Control Rods]]， 点击右键则可以将选定的控制棒分配至相应颜色的组别。彩色按钮下方的文本 框可用于设置所有选定的燃料棒的抽出程度。最后一个红白渐变色按钮可以切 换选定的[[蒸汽管道|RBMK Steam Channel]]的压缩等级。"
	}
}
