{
	"name": "Coke",
	"icon": ["hbm:item.coke", 1, 0],
	"trigger": [["hbm:item.coke", 1, 32767]],
	"title": {
		"en_US": "Coke",
		"uk_UA": "Кокс",
		"ru_RU": "Кокс",
		"zh_CN": "焦炭"
	},
	"content": {
		"en_US": "High-purity carbon, has twice the burn value of coal. Can be pressed into [[graphite|Graphite]], used in various [[steel|Steel]] recipes or as a source of carbon for the [[crucible|Crucible]].<br><br>Coal coke can be made by smelting coal briquettes, or combination smelting coal in its various forms.<br><br>Lignite coke is made from the much cheaper and less powerful lignite in much the same way, despite this it has the same characteristics.<br><br>Petroleum coke is made either from non-coal tars in a [[combination oven|Combination Oven]], or by coking various types of oil in a [[coker|Coker Unit]].",
		"uk_UA": "Високочистий вуглець, має вдвічі вищу горючість, ніж вугілля. Може бути зпресований у [[графіт|Graphite]], використовується у різних рецептах [[сталі|Steel]] або як джерело вуглецю для [[ливарні|Crucible]].<br><br>Вугільний кокс можна виготовляти шляхом обсмаження вугільних брикетів або коксування вугілля в різних його формах.<br><br>Буровугільний кокс виготовляється з набагато дешевшого та менш потужного бурого вугілля майже таким самим способом, незважаючи на це, він має ті ж характеристики.<br><br>Нафтовий кокс виготовляється або з невугільних смол у [[коксовій печі|Combination Oven]], або шляхом коксування різних видів нафтопродуктів у [[коксовій установці|Coker Unit]].",
		"ru_RU": "Высокочистый углерод, имеет вдвое большую энергию сгорания, чем уголь. Может быть спрессован в [[графит|Graphite]], используется в различных рецептах [[стали|Steel]] или как источник углерода для [[плавильни|Crucible]].<br><br>Угольный кокс можно получить путём переплавки угольных брикетов или комбинированной переплавки угля в различных формах.<br><br>Бурый кокс изготавливается из более дешёвого и менее мощного бурого угля тем же способом, но обладает теми же характеристиками.<br><br>Нефтяной кокс производится либо из неугольных смол в [[коксовой печи|Combination Oven]], либо путём коксования различных видов масла в [[коксовой установке|Coker Unit]].",
		"zh_CN": "高纯度的碳，其热值为煤炭的两倍。可被锻压为[[石墨|Graphite]]，也可用于多种炼[[钢|Steel]]配方或作为[[坩埚|Crucible]]中碳的来源。<br><br>煤焦炭可通过在熔炉中烧炼煤球获取，或在复式炼焦炉中炼焦各种形式的煤炭获取。<br><br>褐煤焦炭可以以更廉价且品质更低的褐煤为原料，通过相同的方式获取， 尽管其特性与煤焦炭完全相同。<br><br>石油焦炭可通过在[[复式炼焦炉|Combination Oven]]中炼焦焦油（煤焦油除外）获取，也可通过在[[焦化装置|Coker Unit]]中焦化多种油获取。"
	}
}
