{
	"name": "Redstone over Radio",
	"icon": ["hbm:tile.radio_telex", 1, 0],
	"trigger": [],
	"title": {
		"en_US": "Redstone over Radio",
        "ru_RU": "Редстоун-по-радио"
	},
	"content": {
		"en_US": "Redstone over radio is a system that allows signals to be sent and received within a dimension, with no delay or distance restrictions. In its most basic form, redstone over radio can be used to send redstone signals with standard impulse strengths of 0 - 15 to control simple mechanisms from afar, however there are no actual restrictions on what exactly a signal can be. Depending on the application, larger numbers or even text can be sent, and interpreted as needed.<br><br>To get a simple RoR setup to work, only a single RoR compatible transmitter and receiver are needed. RoR transmitters for example will, if not configured to do otherwise, simply translate the redstone signal of the block they are connected to into a radio signal with that numeric value, and RoR receivers will turn that numeric radio signal back into a redstone signal.<br><br>Most RoR compatible machines have two operating modes, \"State Change\" and \"Polling\". When set to state change, transmitters will only send one single impulse when their signal changes, and receivers will update their output once they receive such an impulse. This means that, should a transmitter unload or be destroyed, receivers will retain their most recent signal. Polling means that checks are expected every tick, so transmitters will send constantly and receivers will listen constantly, should a transmitter unload or be destroyed, the receiver will immediately lose the signal.<br><br>To send a signal, a frequency must be specified, one frequency can only hold one signal at a time. If multiple signlals are sent on one frequency, the most recent signal is the one that's preferred. There is however an exception to this rule: If there's two numeric signals on the same frequency and within the same tick, the resulting frequency is the sum of all numeric signals being sent.<br><br>Redstone over radio transmitting devices include:<br>* [[Redstone-over-Radio Transmitter]]: The simplest of transmitters, either just sends the strength of a redstone signal, or can use custom redstone strength to text mapping<br>* [[Redstone-over-Radio Item Counter]]: Counts the configured items in a connected container and sends them on the specified frequencies, up to three items can be configured<br>* [[Redstone-over-Radio Reader]]: Can be connected to machines that support it to read values and then send those values over the specified frequencies<br><br>Redstone over radio receiving devices include:<br>* [[Redstone-over-Radio Receiver]]: The simplest receiving device which either receives numerical values and emits them as redstone signals, or maps custom values to redstone signals<br>* [[Redstone-over-Radio Logic Receiver]]: A more advanced receiver that uses a list of logic operations, like comparing numeric values or text, to figure out what redstone signal to emit<br>* [[Redstone-over-Radio Controller]]: An advanced component that can be connected to supporting machines, where it can receive commands with parameters to perform certain actions with that machine<br><br>Additionally, some devices can transmit and receive signals simultaneously:<br>* [[TELEX Machine]]: Wireless communications that can send and receive text, letter by letter",
		"ru_RU": "Редстоун-по-радио - это система приёма и отправки сигналов в пределах измерения без каких-либо задержек на любые расстояния. Самые простые схемы редстоун-радио можно использовать для передачи редстоун-сигналов с силой в диапазоне от 0 до 15 для управления простыми механизмами на расстоянии, однако фактических ограничений содержания сигнала нет. В зависимости от задачи, могут быть отправлены более крупные цифры или даже текст, которые могут быть интерпретированы по мере необходимости.<br><br>Для работы РпР необходим только один передатчик и приёмник, совместимые с РпР. Например, передатчики РпР по умолчанию лишь преобразуют редстоун-сигнал подключенного к ним блока в радиосигнал с числовым значением, а приёмники РпР переводят этот цифровой радиосигнал обратно в силу редстоун-сигнала.<br><br>Большинство устройств, совместимых с РпР, имеют два режима работы: \"State Change\" и \"Polling\". При настройке State Change передатчики будут посылать только один импульс при изменении настроек своего сигнала, а приёмники обновят свои выходные данные, как только получат такой импульс. Это означает, что в случае отсоединения передатчика или его уничтожения приёмники сохраняют последний полученный сигнал. Polling означает, что проверка входящих сигналов осуществляется каждый тик, поэтому передатчики будут отправлять сообщения бесперерывно, а приёмники будут их постоянно улавливать. Если передатчик будет отсоединён или уничтожен, приёмник немедленно потеряет сигнал.<br><br>Для отправки сигнала необходимо указать конкретную частоту, так как каждая частота несёт только один сигнал за раз. Если на одной частоте передаётся несколько сигналов, приоритетным является самый последний сигнал. Однако есть исключение: если есть два числовых сигнала на одной частоте и в пределах одного тика, результирующая частота равна сумме всех отправляемых числовых сигналов.<br><br>К редстоун-по-радио устройствам относятся:<br>* [[Redstone-over-Radio Transmitter]]: Самый простой из передатчиков, который либо просто передаёт силу редстоун-сигнала, либо преобразует текст в редстоун-сигнал<br>* [[Redstone-over-Radio Item Counter]]: Подсчитывает указанные предметы в подключенном к нему контейнере и отправляет значение по указанному адресу. Можно указать до 3 предметов<br>* [[Redstone-over-Radio Reader]]: подключается к совместимым с ним механизмам, считывает значение их свойств и отправляет их на заданных частотах.<br><br>Редстоун-радио принимающие устройства включают в себя:<br>* [[Redstone-over-Radio Receiver]]: самое простое принимающее устройство, которое получает числовые значения и выдает их в виде редстоун-сигнала или преобразует пользовательские текстовые значения в редстоун-сигналы<br>* [[Redstone-over-Radio Logic Receiver]]: более продвинутый приёмник, который использует список таких логических операций, как сравнение числовых значений или текста, чтобы определить, какой редстоун-сигнал нужно подать<br>* [[Redstone-over-Radio Controller]]: Усовершенствованный компонент, который может быть подключен к совместимым с ним мехнизмам, где он будет получать команды с параметрами для настройки самих механизмов<br><br>Кроме того, некоторые устройства могут передавать и получать сигналы одновременно:<br>* [[TELEX Machine]]: Беспроводная связь, которая может отправлять и получать текст, буква за буквой"
	}
}
