{
	"name": "Redstone-over-Radio Controller",
	"icon": ["hbm:tile.radio_torch_controller", 1, 0],
	"trigger": [["hbm:tile.radio_torch_controller"]],
	"title": {
		"en_US": "Redstone-over-Radio Controller",
		"ru_RU": "Редстоун-по-радио контроллер",
		"zh_CN": "无线红石信号控制器"
	},
	"content": {
		"en_US": "Advanced [[redstone over radio|Redstone over Radio]] receiving device, listens on one frequency for commands to execute for the connected block. Commands follow the format of <command_name>!<parameter1>:<parameter2> where the actual command name is followed by a \"!\" which separates the command name from the parameters, which are separated from one another with \":\". Hovering over the [V] icon will list available commands for the connected block, as well as what parameters are accepted.<br><br>The controller can be used for example for barrels, where the \"setmode\" command can use a number from 0 to 3 to change the barrel's IO mode. The second variant of the same command has another parameter, which is a fallback to use if the first specified mode is already selected, ultimately allowing the command to \"switch\" between two modes instead of just setting it.",
		"ru_RU": "Продвинутое принимающее [[редстоун-по-радио|Redstone over Radio]] устройство, которое прослушивает определённую частоту, ожидая команды для настройки работы подключенного к нему блока. Команды записываются в формате <название_команды>!<параметр1>:<параметр2>, где за названием команды следует символ \"!\", который отделяет название от параметров. Сами же параметры разделяются символом \":\". При наведении курсора на значок [V] отобразится список доступных команд для подключенного блока, а также список принятых параметров.<br><br>Контроллером можно настраивать, например, бочки с помощью команды \"setmode\", которая использует число от 0 до 3 для изменения режима ввода-вывода. Если используются два параметра, второй из которых является запасным, то подача редстоун-сигнала позволит \"переключаться\" между двумя параметрами, чтобы не настраивать каждый в отдельности.",
		"zh_CN": "高级的[[无线红石信号|Redstone over Radio]]接收器，可监听一个频率中发送的指令，并在 相连的方块中执行该指令。命令的格式为 <命令名称>!<参数1>:<参数2>， 真正的命令名称后跟随一个用于分隔命令名称和参数的英文叹号，两个参数之 间使用英文冒号分隔。鼠标指针悬浮在[V]图标上时可以查看连接的方块支 持的所有指令及接受的参数。<br><br>例如，控制器可以用于流体桶：流体桶的“setmode”命令可用于调整 流体桶的输入输出模式，该命令接受的参数是0~3间的数字；同一命令的另 一版本还具有第二个参数，其中第二个参数用作回退值，会在流体桶处于第一 个参数指定的模式时使用，最终达到在两个模式间“切换”而非仅设定一个模 式的效果。"

	}
}
