{
	"name": "Redstone-over-Radio Transmitter",
	"icon": ["hbm:tile.radio_torch_sender", 1, 0],
	"trigger": [["hbm:tile.radio_torch_sender"]],
	"title": {
		"en_US": "Redstone-over-Radio Transmitter",
		"ru_RU": "Редстоун-по-радио контроллер",
		"zh_CN": "无线红石信号发射器"
	},
	"content": {
		"en_US": "Basic [[redstone over radio|Redstone over Radio]] transmitting device, reads the redstone signal strength of the block it is connected to (connecting redstone to the torch itself does nothing) and sends a radio signal based on that. If no redstone signal is found, it will act like a comparator, meaning it can read the fill state of chests or barrels and interpret them in increments from 0 to 15. By default, it is set to \"Redstone Passthrough\" which means it will simply send the numeric value of the redstone signal it receives. If set to \"Custom Mapping\", it will instead translate the received value to a specified line of text, and send that text instead. Text that only contains numbers can be interpreted like numbers by receivers that support it.",
		"ru_RU": "Классическое передающее [[редстоун-по-радио|Redstone over Radio]] устройство, которое считывает уровень редстоун-сигнала от блока, к которому оно подключено (редстоун-подключение к факелу или другому постоянному источнику ничего не даёт), и отправляет радиосигнал, основываясь на входных данных. Если редстоун-сигнал не обнаружен, он будет действовать как компаратор, то есть сможет считывать уровень заполнения сундуков или бочек и интерпретировать их в виде числовых значений от 0 до 15. По умолчанию для него установлено значение \"Redstone Passthrough\", чтобы отправлять числовое значение силы полученного редстоун-сигнала. Если установлено значение \"Custom Mapping\", то вместо этого полученный редстоун-сигнал преобразуется в указанную строку текста, который и будет отправлен. Текст, состоящий только из чисел, понимается получателями просто как числа.",
		"zh_CN": "基础的[[无线红石信号|Redstone over Radio]]发射装置，可以读取相邻方块的红石信号强度 （直接对信号发射器输入红石信号无效），并根据输入的信号强度发出信号。 如果不向信号发射器输入红石信号，那么其会作为比较器工作，即读取连接的 容器的充满程度，并将其转换为0~15间的信号。默认情况下，信号发射器 设定在“信号直传”模式，即直接发送红石信号强度对应的数值型信号。若设定 为“自定义映射”模式，其会将接收的信号强度转换为特定的文本并将其发送。 只包含数字的文本也可以被支持的信号接收器作为数值解析。"
	}
}
