{
	"name": "Dipole Magnets",
	"icon": ["hbm:tile.pa_dipole", 1, 0],
	"trigger": [["hbm:tile.pa_dipole"]],
	"title": {
		"en_US": "Dipole Magnets",
		"ru_RU": "Дипольные магниты",
		"zh_CN": "双极磁铁"
	},
	"content": {
		"en_US": "Active component of the [[particle accelerator|Particle Accelerator]]. Used to direct particles around corners, which enables loops and branches.<br><br>Dipoles need to be configured to be usable. The first output setting determines the direction of the particle when it does not meet the speed threshold, the second determines the direction if it does, and the third determines the direction if the threshold is met AND a redstone signal is applied to one of the dipole's ports. Below the direction settings is a text field for configuring the threshold speed. <br><br>Ideally, the threshold should be set below the upper limit of the coils used in the same accelerator ring. This causes the particle to leave the ring before it can exceed the coil's maximum speed and crash.<br><br>This component uses [[large coils|Large Coil]], keep coil restrictions in mind when building the accelerator!<br><br>This component requires cooling through [[cold perfluoromethyl|Perfluoromethyl]]. The returned room temperature fluid can be cooled again using [[compressors|Compressor]].",
		"ru_RU": "Активный компонент [[ускорителя частиц|Particle Accelerator]]. Используется для направления частиц под углом, создания поворотов, петель или ответвлений.<br><br>Диполи должны быть сконфигурированы таким образом, чтобы их можно было использовать. Первый параметр в настройках выхода частицы определяет направление частицы, которая не достигла порогового значения скорости, второй определяет направление, если значение удовлетворяет этому условию, и третий указывает траекторию движения при достижении порогового значения и наличии редстоун-сигнала, который подаётся на один из портов диполя. Под настройками направления находится текстовое поле для указания порога скорости.<br><br>В идеале это значение должно быть установлено ниже верхнего предела для катушек, используемых в одном и том же контуре ускорителя. Благодаря этому частица покинет контур до превышения максимального значения скорости для катушки и, следовательно, уничтожения.<br><br>В этом компоненте используются [[большие катушки|Large Coil]], поэтому учитывайте их ограничения при проектировании ускорителя!<br><br>Этот компонент требует охлаждения [[холодным перфторметаном|Perfluoromethyl]]. Отработанную нагретую жидкость можно охладить с помощью [[компрессоров|Compressor]] и использовать повторно.",
		"zh_CN": "[[粒子加速器|Particle Accelerator]]的工作部件，用于在拐角处引导粒子，形成循环和分支结构。<br><br>使用双极磁铁前需要对其进行配置。第一个输出设置决定速度低于阈值的粒子 的输出方向，第二个决定速度高于阈值的粒子的输出方向，第三个决定通入红石 信号时速度高于阈值的粒子的输出方向。方向设置下方的文本框是用于设置阈 值速度的文本框。<br><br>理想情况下速度阈值应设定为低于同一加速器结构中使用的线圈的速度上限的 值，这样粒子就可以在自身速度超过线圈上限速度并坠毁之前离开环形结构。<br><br>此部件使用[[大型线圈|Large Coil]]，建造加速器时请注意线圈限制！<br><br>此部件需要[[冷四氟甲烷|Perfluoromethyl]]冷却，返还的普通四氟甲烷可以用[[压缩机|Compressor]] 重新冷却。"
	}
}
