{
	"name": "Particle Accelerator",
	"icon": ["hbm:tile.pa_detector", 1, 0],
	"trigger": [["hbm:tile.pa_detector"]],
	"title": {
		"en_US": "Particle Accelerator",
		"ru_RU": "Ускоритель частиц",
		"zh_CN": "粒子加速器"
	},
	"content": {
		"en_US": "A particle accelerator is a large dynamic structure made from multiple components. In short, particles are fired from [[particle sources|Particle Source]] along [[beamlines|Beamline]], accelerated via [[RF cavities|RF Cavity]], refocussed with [[quadrupoles|Quadrupole Magnets]], redirected with [[dipoles|Dipole Magnets]] and finally received by a [[particle detector|Particle Detector]].<br><br>In order for a recipe to complete, a particle, using the correct ingredients, needs to reach the detector with at least the required speed. Particles gain 100 points of momentum when passing an RF cavity, but this also creates 100 points of defocus. Defocus can be reduced with quadrupoles, 100 points at a time. If the defocus exceeds 1000, the particle crashes. Most components are linear, however dipoles can be used to change the particle's path depending on its speed, allowing turns, branches and loops to be made.<br><br>The most simple accelerator is a particle source connected to several RFCs, then quadrupoles for refocusssing and finally the detector, forming a linear accelerator. This however limits the final momentum to the amount of RFCs x100. By using dipoles to form a ring, particles can follow the loop and make use of the same RFCs and quadrupoles multiple times. However, the [[coils|Large Coil]] used by both quadrupoles and dipoles have limits on how fast the particle can be, meaning that once the particle becomes too fast, it needs to leave the ring. One ring however can lead into another, with better coils, which have a higher speed limit. Starting off with higher tier coils right away is not advised, since coils also have a minimum speed, although this doesn't immediately cause the particle to crash. An ideal accelerator that is not subject to any coil penalties and can perform any recipe is one with multiple rings, each using higher tier coils. Dipoles can be configured with redstone so that rings that add more speed than necessary can be skipped, ending the particle's path early.<br><br>In addition to power, most accelerator parts require cooling. [[Cold perfluoromethyl|Perfluoromethyl]] needs to be pumped into the components, which returns room temperature PFM that can be cooled down again. Creating cold PFM requires two sets of [[compressors|Compressor]], one compressing PFM to a pressure of 1 PU and one to compress it further, yielding cold PFM.<br><br>Most parts of the accelerator have a fixed direction that the particle needs to follow. Mind the red arrows on the components.<br><br>A step-by-step guide on how to build a very basic single ring accelerator can be found [[here|PA Guide]]",
		"ru_RU": "Ускоритель частиц - это большая динамическая структура, состоящая из множества компонентов. Говоря кратко, частицы выбрасываются из [[источника частиц|Particle Source]] в [[канал пучка|Beamline]], ускоряются с помощью [[радиочастотных резонаторов|RF Cavity]], восстанавливают фокус с помощью [[квадруполей|Quadrupole Magnets]], перенаправляются с помощью [[диполей|Dipole Magnets]] и, наконец, улавливаются [[детектором частиц|Particle Detector]].<br><br>Для выполнения рецепта частица, использующая правильные ингредиенты, должна достичь детектора со скоростью, что будет не меньше требуемой. Частицы набирают 100 единиц импульса при прохождении радиочастотного резонатора, но это также увеличивает их расфокусировку на 100. Расфокусировку можно уменьшить с помощью квадруполей по 100 единиц за раз. Если расфокусировка превышает 1000, частица разрушается. Большинство компонентов направляют пучок линейно, однако диполи могут изменять траекторию частицы в зависимости от её скорости, что позволяет создавать ответвления и петли.<br><br>Самый простой ускоритель выглядит так: источник частиц, подключённый к нескольким РЧР, затем идут квадруполи для повторной фокусировки и, наконец, детектор, оканчивающий линейную конструкцию ускорителя. Но такая конструкция ограничивает итоговый импульс до значения, пропорционального количеству РЧР. Используя диполи для формирования замкнутого контура, можно заставить частицы проходить один и тот же контур несколько раз (пролетать через одни и те же РЧР и квадруполи). Однако [[большие катушки|Large Coil]], используемые как квадруполями, так и диполями, имеют ограничения на скорость частицы, из чего следует, что частице необходимо покинуть контур при достижении пороговой скорости. Тем не менее, один контур может переходить в другой, где стоят более мощные катушки, которые имеют более высокий предел скорости. Не рекомендуется использовать катушки более высокого уровня сразу, поскольку имеется и минимальное ограничение скорости (однако его достижение не приводит к разрушению частицы). Идеальный и универсальный ускоритель, работающий без штрафов за ограничения - это ускоритель с несколькими замкнутыми контурами, в каждом из которых мощность катушек возрастает. Диполи можно настроить с помощью редстоун-сигнала таким образом, что контуры, разгоняющие выше необходимой скорости, могли бы быть пропущены для своевременной остановки частицы.<br><br>Кроме питания, большинство деталей ускорителя требуют охлаждения. [[Холодный перфторметан|Perfluoromethyl]] необходимо закачать в те компоненты, что возвращают ПФМ комнатной температуры. Тёплый ПФМ можно охладить с целью повторного использования. Для создания холодного ПФМ требуются два [[компрессора|Compressor]], один из них будет сжимать ПФМ до 1 PU, а другой - сжимать ещё раз с получением уже холодного ПФМ.<br><br>Большинство частей ускорителя имеют фиксированное направление движения частицы. Обращайте внимание на красные стрелки на компонентах.<br><br>Пошаговое руководство по сборке самого простого одноконтурного ускорителя можно найти [[здесь|PA Guide]]",
		"zh_CN": "粒子加速器是一种由多种部件搭建成的动态结构。简单来说，粒子从[[粒子源|Particle Source]] 发射，沿[[束流管|Beamline]]移动，由[[射频腔|RF Cavity]]加速，借助[[四极磁铁|Quadrupole Magnets]]重新聚焦， 借助[[双极磁铁|Dipole Magnets]]转向，并最终被[[粒子探测器|Particle Detector]]探测。<br><br>为了能够完成配方，在原料正确的前提下，粒子需要以不低于需求速度的速度 到达粒子探测器。粒子每经过一个射频腔会获得100点动量，但也会得到100点 失焦；失焦可通过四极磁铁降低，每个降低100点，且失焦超过1000点时 粒子会坠毁。大多数加速器部件都是直线形的，但是双极磁铁可以根据粒子的 速度改变其运动方向，这使得可以建造出转弯、分叉型和环型的加速器结构。<br><br>最简单的加速器由一台连接到若干射频腔的粒子源、用于重新聚集粒子的四极 磁铁和末端的粒子探测器组成，最后可以搭建成直线加速器；然而这种设计会将 粒子的最终动量限制在射频腔数量x100。而使用双极磁铁构建环形结构后， 粒子就可以在环形中反复运行，并重复利用同一批射频腔和四极磁铁多次。然 而，用于四极磁铁和双极磁铁的[[线圈|Large Coil]]能处理的粒子速度有限制，因此一旦 粒子速度过快，就需要离开环形。尽管如此，一个环也可以连接至另外一个使 用了更高级线圈、可以处理更快速度的粒子的环。由于线圈也具有最小需求速 度，不建议从一开始就使用高级线圈，虽然这样做不会导致粒子立刻坠毁。一个 理想的不受任何线圈惩罚影响且可以运行所有配方的粒子加速器应该由多个环 形结构组成，每个环形结构依次使用更高级的线圈。可以通过配置双极磁铁使 得系统能够提前跳过不必要的加速部分，并使粒子提前输出。<br><br>大多数加速器部件不仅需要电能，还需要冷却。冷却加速器部件需要向其通入 [[冷四氟甲烷|Perfluoromethyl]]，此过程会返还普通的四氟甲烷，返还的四氟甲烷还可被再次 冷却。制造冷四氟甲烷需要两台[[压缩机|Compressor]]，一台用于将四氟甲烷加压到1PU， 另一台用于进一步将1PU的四氟甲烷压缩为冷四氟甲烷。<br><br>大多数部件只允许粒子以固定方向通过，注意观察部件上指示方向的红色箭头。<br><br>[[此处|PA Guide]]有一份搭建最基础的单环加速器的逐步教程。"
	}
}
