{
	"name": "Particle Accelerator",
	"icon": ["hbm:tile.pa_detector", 1, 0],
	"trigger": [["hbm:tile.pa_detector"]],
	"title": {
		"en_US": "Particle Accelerator"
	},
	"content": {
		"en_US": "A particle accelerator is a large dynamic structure made from multiple components. In short, particles are fired from [[particle sources|Particle Source]] along [[beamlines|Beamline]], accelerated via [[RF cavities|RF Cavity]], refocussed with [[quadrupoles|Quadrupole Magnets]], redirected with [[dipoles|Dipole Magnets]] and finally received by a [[particle detector|Particle Detector]].<br><br>In order for a recipe to complete, a particle, using the correct ingredients, needs to reach the detector with at least the required speed. Particles gain 100 points of momentum when passing an RF cavity, but this also creates 100 points of defocus. Defocus can be reduced with quadrupoles, 100 points at a time. If the defocus exceeds 1000, the particle crashes. Most components are linear, however dipoles can be used to change the particle's path depending on its speed, allowing turns, branches and loops to be made.<br><br>The most simple accelerator is a particle source connected to several RFCs, then quadrupoles for refocusssing and finally the detector, forming a linear accelerator. This however limits the final momentum to the amount of RFCs x100. By using dipoles to form a ring, particles can follow the loop and make use of the same RFCs and quadrupoles multiple times. However, the [[coils|Large Coil]] used by both quadrupoles and dipoles have limits on how fast the particle can be, meaning that once the particle becomes too fast, it needs to leave the ring. One ring however can lead into another, with better coils, which have a higher speed limit. Starting off with higher tier coils right away is not advised, since coils also have a minimum speed, although this doesn't immediately cause the particle to crash. An ideal accelerator that is not subject to any coil penalties and can perform any recipe is one with multiple rings, each using higher tier coils. Dipoles can be configured with redstone so that rings that add more speed than necessary can be skipped, ending the particle's path early.<br><br>In addition to power, most accelerator parts require cooling. [[Cold perfluoromethyl|Perfluoromethyl]] needs to be pumped into the components, which returns room temperature PFM that can be cooled down again. Creating cold PFM requires two sets of [[compressors|Compressor]], one compressing PFM to a pressure of 1 PU and one to compress it further, yielding cold PFM.<br><br>Most parts of the accelerator have a fixed direction that the particle needs to follow. Mind the red arrows on the components.<br><br>A step-by-step guide on how to build a very basic single ring accelerator can be found [[here|PA Guide]]"
	}
}
