{
	"name": "PA Guide",
	"icon": ["hbm:tile.pa_detector", 1, 0],
	"trigger": [["hbm:tile.pa_detector"]],
	"title": {
		"en_US": "Particle Accelerator Starter Guide"
	},
	"content": {
		"en_US": "Place a [[particle source|Particle Source]] and connect the front end to a [[beamline|Beamline]]. The front of the source is the part that also looks like a beamline. Ensure that the beamline's orientation, indicated by the red arrows, points away from the source, as this is the direction the particle follows. Place a [[dipole|Dipole Magnets]] fitted with a [[large gold coil|Large Coil]], and configure the top two options (below and above the threshold) to point away from the particle source. In that direction, place another beamline connecting to the dipole, then an [[RF cavity|RF Cavity]], another beamline, a [[quadrupole|Quadrupole Magnets]] fitted with another large gold coil, another beamline, and finally another dipole, again with gold coils. Configure the dipole to do a 90° turn. Not counting the initial source, you should now have one side of the accelerator ring, dipole -> RFC -> quadrupole -> dipole. In the direction that the second dipole turns, repeat that pattern three times, always doing another 90° turn, until the ring is complete. Finally, in the dipole opposite to the source, the one at the end of the first side we built, change the direction of the second setting (direction if the particle meets the threshold) to go straight instead of doing a turn, then set the threshold to 2000. The particle will do five full circles, then the first side again, accumulating a total of 2100 momentum, which is less than the maximum of the gold coils, and then leave the accelerator. In the direction that the particle leaves in, place one last beamline and finally the detector. Connect all parts to electricity and to a source of [[cold perfluoromethyl|Perfluoromethyl]], pipe back the resulting warm perfluoromethyl into a [[compressor|Compressor]], then pipe that into a second compressor, this should create cold PFM again, closing the cooling cycle.<br><br>This setup should be able to perform some of the more basic recipes, and forms the basis on which all accelerators are built. Once you understand the system, it should be trivial to remove the detector and replace it with a larger secondary ring with stronger coils, which allows particles to go even faster. Single ring accelerators are still possible though, as particles that are slower than the coil minimum won't crash immediately, however this means that the accelerator is hit with a hefty penalty, requiring 10x more power, and the ring size needs to match the minimum of the coil, otherwise both penalties stack up and the particle crashes instantly.<br><br>Return to the [[particle accelerator overview page|Particle Accelerator]] and check out all the components individually, understanding the components is crucial in understanding the full accelerator."
	}
}
