{
	"name": "Particle Source",
	"icon": ["hbm:tile.pa_source", 1, 0],
	"trigger": [["hbm:tile.pa_source"]],
	"title": {
		"en_US": "Particle Source",
		"ru_RU": "Источник частиц",
		"zh_CN": "粒子源"
	},
	"content": {
		"en_US": "Initial component of the [[particle accelerator|Particle Accelerator]], starts particles and runs the simulation. Will begin a recipe if there is at least one item in each input slots.<br><br>The blue info button will display the accelerator's previous stats when hovered over. It also shows various messages depending on the previous result or error. The red button cancels an operation, which is useful if a particle is stuck in an infinite loop due to an incorrectly constructed accelerator ring.<br><br>List of messages:<br>* Paused: The particle has reached an unloaded chunk. Chunks need to be loaded for particles to be simulated.<br>* Defocus: The particle has exceeded 1000 points of defocus, indicating that there's not enough quadrupoles in the current ring. May also happen if a particle enters a [[detector|Particle Detector]] while having more than 0 defocus.<br>* Derail: The particle has left the accelerator, either because a part is not connected or because it is oriented incorrectly.<br>* Denied: The particle tried to enter a part of the accelerator it can't, that part may be oriented incorrectly.<br>* No cooling: The particle tried to enter part of the accelerator that doesn't receive necessary cooling.<br>* No power: Part of the accelerator may not be sufficiently powered, including various penalties for not meeting [[coil requirements|Large Coil]]. Also happens if mutliple coil penalties are active at once, due to the power draw exceeding the part's buffer.<br>* Overspeed: The particle has crashed because it has exceeded the maximum operating speed of a coil it passed.<br>* No recipe: The particle has completed an operation, but the ingredients do not create a result.<br>* Underspeed: he particle has completed an operation with valid ingredients, but the final speed was not enough to complete the recipe.<br><br>This component requires cooling through [[cold perfluoromethyl|Perfluoromethyl]]. The returned room temperature fluid can be cooled again using [[compressors|Compressor]].<br><br>This component is one-way only, make sure the particle follows the red arrows!",
		"ru_RU": "Стартовый компонент [[ускорителя частиц|Particle Accelerator]], запускает частицы. Начинает выполнять рецепт, если каждый слот ввода не пуст.<br><br>Синяя справочная кнопка отображает характеристики предыдущего процесса. Также она показывает различные сообщения в зависимости от прошлого результата или ошибки. Красная кнопка отменяет операцию, что необходимо при попадании частицы в ловушку бесконечного цикла из-за неправильно сконструированного контура.<br><br>Список сообщений:<br>* Приостановлено: частица достигла непрогруженного чанка. Для продолжения процесса необходима прогрузка чанка.<br>* Расфокус: расфокусировка частицы превысила 1000 единиц, следовательно, в текущем контуре недостаточно квадруполей. Также это может произойти, если частица влетает в [[детектор|Particle Detector]], имея значение расфокусировки больше 0. <br>* Сход с рельсов: частица внепланово покинула ускоритель: либо стороны не соединены, либо нарушена ориентация.<br>* Отменено: частица безуспешно пыталась войти в компонент ускорителя, что могло случиться из-за его неправильной ориентации.<br>* Нет охлаждения: частица пыталась войти в компонент ускорителя, который не получает необходимого охлаждения.<br>* Нет питания: часть ускорителя не получает достаточно энергии, что возможно и ввиду различных штрафов за несоблюдение [[требований к катушкам|Large Coil]]. Также это происходит, если одновременно активируются несколько штрафов, из-за чего траты превышают буфер энергии компонента.<br>* Превышение скорости: частица разбилась из-за превышения верхнего предела катушки, через которую она прошла.<br>* Нет рецепта: частица завершила операцию, но ингредиенты не дают результата.<br>* Недостаточная скорость: частица завершила операцию с нужными ингредиентами, но не набрала достаточную для завершения рецепта скорость.<br><br>Этот компонент требует охлаждения [[холодным перфторметаном|Perfluoromethyl]]. Отработанную нагретую жидкость можно охладить с помощью [[компрессоров|Compressor]] и использовать повторно.<br><br>Пропускает частицы лишь в одну сторону, ввиду чего необходимо учитывать направление красных стрелок.",
		"zh_CN": "[[粒子加速器|Particle Accelerator]]的初始部件，发射粒子并进行模拟。如果每个输入槽中都至少 有一个物品，那么就会开始运行配方。<br><br>将鼠标指针放在蓝色的信息按钮上时可以显示加速器上一次运行时的数据，同时 会根据上一次运行的结果或错误显示多种信息。红色按钮用于取消正在进行的 操作，当粒子在建造不正确的环形结构中无限循环时会很有用。<br><br>可能出现的消息列表：<br>* 暂停运行：粒子进入了未加载的区块，粒子模拟只能在加载的区块中进行。<br>* 粒子失焦：粒子的失焦超过了1000点，这表明加速器中四极磁铁数量 不足；粒子在失焦大于0时进入[[粒子探测器|Particle Detector]]也会触发此提示。<br>* 粒子脱离轨道：粒子离开了加速器，原因可能是某部件未连接或朝向错误。<br>* 粒子被阻挡：粒子尝试进入加速器部件失败，原因可能是该部件朝向不正确。<br>* 缺少冷却：粒子尝试进入没有接受到足够冷却的加速器部件。<br>* 缺少能量：某些加速器部件的能量供应不足，包含没有达到[[线圈需求|Large Coil]] 的惩罚；也会在同时受到多个线圈惩罚时，由于需求的能量超过了部件的能量 上限时触发。<br>* 粒子速度过快：粒子由于自身速度超过了经过的线圈的最大工作速度而坠毁。<br>* 没有配方：加速器完成了一次操作，但是输入的原料不能产生任何成品。<br>* 粒子速度过低：加速器以合适的原料完成了一次操作，但最终的速度不足以 完成相应配方。<br><br>此部件需要[[冷四氟甲烷|Perfluoromethyl]]冷却，返还的普通四氟甲烷可以用[[压缩机|Compressor]] 重新冷却。<br><br>此部件只允许粒子单向通过，请确保粒子运行方向与红色箭头方向一致！"
	}
}
