{
	"name": "Particle Source",
	"icon": ["hbm:tile.pa_source", 1, 0],
	"trigger": [["hbm:tile.pa_source"]],
	"title": {
		"en_US": "Particle Source"
	},
	"content": {
		"en_US": "Initial component of the [[particle accelerator|Particle Accelerator]], starts particles and runs the simulation. Will begin a recipe if there is at least one item in each input slots.<br><br>The blue info button will dispay the accelerator's previous stats when hovered over. It also shows various messages depending on the previous result or error. The red button cancels an operation, which is useful if a particle is stuck in an infinite loop due to an incorrectly constructed accelerator ring.<br><br>List of messages:<br>* Paused: The particle has reached an unloaded chunk. Chunks need to be loaded for particles to be simulated.<br>* Defocus: The particle has exceeded 1000 points of defocus, indicating that there's not enough quadrupoles in the current ring. May also happen if a particle enters a [[detector|Particle Detector]] while having more than 0 defocus.<br>* Derail: The particle has left the accelerator, either because a part is not connected or because it is oriented incorrectly.<br>* Denied: The particle tried to enter a part of the accelerator it can't, that part may be oriented incorrectly.<br>* No cooling: The particle tried to enter part of the accelerator that doesn't receive necessary cooling.<br>* No power: Part of the accelerator may not be sufficiently powered, including various penalties for not meeting [[coil requirements|Large Coil]]. Also happens if mutliple coil penalties are active at once, due to the power draw exceeding the part's buffer.<br>* Overspeed: The particle has crashed because it has exceeded the maximum operating speed of a coil it passed.<br>* No recipe: The particle has completed an operation, but the ingredients do not create a result.<br>* Underspeed: he particle has completed an operation with valid ingredients, but the final speed was not enough to complete the recipe.<br><br>This component requires cooling through [[cold perfluoromethyl|Perfluoromethyl]]. The returned room temperature fluid can be cooled again using [[compressors|Compressor]].<br><br>This component is one-way only, make sure the particle follows the red arrows!"
	}
}
