{
	"name": "Fusion Reactor",
	"icon": ["hbm:tile.fusion_torus", 1, 0],
	"trigger": [],
	"title": {
		"en_US": "Fusion Reactor",
		"ru_RU": "Термоядерный реактор",
		"zh_CN": "聚变反应堆"
	},
	"content": {
		"en_US": "A powerful and versatile reactor that fuses light elements into heavier ones. Depending on the setup, reactors may be specialized to make as much power as possible, or to make a lot of byproducts efficiently.<br><br>Components:<br>* [[Fusion Reactor Vessel]]: Core component, this is where the plasma is created<br>* [[Klystron]]: Primary energy source<br>* [[Fusion Reactor Collector Chamber]]: Increases byproduct yield<br>* [[Fusion Reactor Breeding Chamber]]: Uses neutron flux from the vessel to process materials<br>* [[Fusion Reactor Boiler]]: Uses plasma energy to boil water<br>* [[MHD Turbine]]: Uses plasma energy to generate electricity directly<br>* [[Fusion Reactor Coupler]]: Uses plasma energy to generate usable klystron energy, allowing plasma vessels to be chained<br><br>The most basic setup for a fusion reactor is a single plasma vessel (\"torus\"), supplied with power and [[perfluoromethyl|Perfluoromethyl]] cooling, and an air-cooled klystron to ignite its plasma. Depending on its purpose, power-generating parts such as boilers and MHDTs, or byproduct-yielding parts like collectors and breeders may be added.<br><br>More advanced setups may employ couplers to create the energy needed to ignite higher-tier plasmas, creating a setup with two ore more toruses. Byproducts from lower stages can be used for certain higher tier plasma types, so one torus may provide both ignition energy and fuel for another.",
		"ru_RU": "Мощный и многофункциональный реактор, который создаёт более тяжёлые элементы путём слияния более лёгких (синтез). В зависимости от проектировки, реакторы могут быть предназначены как для получения максимально большого количества энергии, так и для эффективного получения побочных продуктов.<br><br>Компоненты: <br>* [[Основная камера|Fusion Reactor Vessel]] - краеугольный компонент всей конструкции, в котором создаётся и удерживается плазма<br>* [[Клистрон|Klystron]] - источник первичной энергии<br>* [[Улавливающая камера|Fusion Reactor Collector Chamber]] увеличивает выход побочных продуктов<br>* [[Камера-размножитель|Fusion Reactor Breeding Chamber]] использует нейтронный поток для получения новых материалов<br>* [[Бойлер|Fusion Reactor Boiler]] использует тепло плазмы для нагрева воды<br>* [[МГД-турбина|MHD Turbine]] использует энергию плазмы напрямую для получения электричества<br>* [[Спариватель|Fusion Reactor Coupler]] использует энергию плазмы для поджига плазмы в соседнем реакторе.<br><br>Основная камера, как самый важный компонент, требует питания электричеством и охлаждения [[перфторметаном|Perfluoromethyl]], а также ей необходим клистрон для воспламенения плазмы. Остальные компоненты вроде бойлеров, МГД-турбин, улавливателей или камер размножения могут быть добавлены в соответствии с задачами.<br><br>Спариватели используются для создания продвинутых реакторных схем с несколькими торами, где получается плазма более высокого уровня. Из побочных продуктов ранних этапов работы образуется плазма помощнее: один реактор обеспечивает другой и энергией, и топливом.",
		"zh_CN": "一种强力且用途多样的反应堆，能将轻元素聚合为重元素。聚变反应堆可以用 于产生尽量多的能量，或是高效生产大量副产物，取决于反应堆的具体设计。 <br><br>反应堆部件：<br>* [[聚变反应堆容器|Fusion Reactor Vessel]]：核心部件，等离子体在此产生<br>* [[速调管|Klystron]]：主要能量源<br>* [[聚变反应堆收集室|Fusion Reactor Collector Chamber]]：提高副产物产量<br>* [[聚变反应堆增殖仓|Fusion Reactor Breeding Chamber]]：使用反应堆容器中的中子通量处理物品<br>* [[聚变反应堆锅炉|Fusion Reactor Boiler]]：用等离子体的能量加热水<br>* [[磁流体涡轮|MHD Turbine]]：利用等离子体的能量直接产生电能<br>* [[聚变反应堆等离子体耦合器|Fusion Reactor Coupler]]：使用等离子体的能量产生可用的速调管 能量，以连接多台反应堆容器<br><br>最简单的聚变反应堆由单个反应堆容器（“环形容器”）和一台用于点火的速 调管组成，其中环形容器需要电力和[[四氟甲烷|Perfluoromethyl]]冷却，而速调管则需要 供应用于冷却的压缩空气；根据不同的目的，反应堆中也可以添加反应堆锅 炉、磁流体涡轮等产能部件，或是产物收集室、增殖仓等生产副产物的部件。<br><br>更加复杂的设计可能会包含两台或更多的环形容器，其中会使用耦合器为高等 级的等离子体提供点火所需的能量。低等级等离子体的副产物可以用于一些高 等级的等离子体，因此一台环形容器可能会同时为另一台环形容器提供燃料和 点火所需的能量。"
	}
}

