{
	"name": "MHD Turbine",
	"icon": ["hbm:tile.fusion_mhdt", 1, 0],
	"trigger": [["hbm:tile.fusion_mhdt"]],
	"title": {
		"en_US": "MHD Turbine",
		"ru_RU": "МГД-турбина",
		"zh_CN": "磁流体涡轮发电机"
	},
	"content": {
		"en_US": "Magnetohydrodynamic turbines are advanced components of the [[fusion reactor|Fusion Reactor]] that make electric energy out of plasma energy directly without needing steam or turbines, as a [[boiler|Fusion Reactor Boiler]] would. While more expensive and requiring [[perfluoromethyl|Perfluoromethyl]] cooling, they do have an innate +35% conversion bonus from TU to HE. In addition, the MHD turbine requires a minimum input of 5MTU/t of plasma energy to operate normally, otherwise efficiency will be halved.<br><br>Due to using plasma energy, MHDTs are affected by port sharing rules, meaning that having multiple connected MHDTs (or boilers) decreases the amount of energy each turbine gets, but overall increases the total amount extracted from the torus.<br><br>MHDTs do in fact not have any moving parts, instead the large rotating copper wheel is part of its cooling system. Ya dweeb.",
		"ru_RU": "Продвинутый компонент [[термоядерного реактора|Fusion Reactor]], который извлекает электричество из энергии плазмы напрямую, без использования вспомогательных процессов (вроде нагрева воды и прогона пара через паровые турбины). Дороговизна и необходимость в охлаждении [[перфторметаном|Perfluoromethyl]] окупаются безупречными значениями эффективности (135%). В дополнение следует сказать, что турбине необходима мощность не менее 5 MTU/с энергии плазмы, иначе эффективность механизма снизится вдвое.<br><br>Поскольку турбина использует энергию плазмы, на неё распространяется правило совместного использования портов: если к тору подключено сразу несколько бойлеров или турбин, каждый из потребителей по отдельности получит меньше энергии, хотя от самого тора суммарно энергии будет отведено больше.<br><br>МГДТ вообще-то почти не имеют подвижных запчастей, а большой вращающийся медный маховик является частью системы охлаждения. Да, душнила. :nerd:",
		"zh_CN": "磁流体涡轮是用于[[聚变反应堆|Fusion Reactor]]的产能设备，能够直接利用等离子体产生电能。与[[反应堆锅炉|Fusion Reactor Boiler]]不同，其不需要蒸汽和汽轮机就能发电。磁流体涡轮虽然成本更高，且需要[[四氟甲烷|Perfluoromethyl]]冷却，但其将TU转换为HE时有35%的加成。另外，磁流体涡轮需要至少 5MTU/t的能量输入才能正常工作，否则其效率会减半。<br><br>由于会消耗等离子体的能量，磁流体涡轮会受到端口分配规则的影响，即在同 一反应堆上连接多个磁流体涡轮（或反应堆锅炉）会降低单个涡轮得到的能量， 但从反应堆容器中提取的总能量会增加。<br><br>事实上，磁流体涡轮并没有任何活动的部件，模型中旋转的铜轮只是其冷却系 统的一部分。真是奇怪……"
	}
}
