{
	"name": "MHD Turbine",
	"icon": ["hbm:tile.fusion_mhdt", 1, 0],
	"trigger": [["hbm:tile.fusion_mhdt"]],
	"title": {
		"en_US": "MHD Turbine",
		"ru_RU": "МГД-турбина"
	},
	"content": {
		"en_US": "Magnetohydrodynamic turbines are advanced components of the [[fusion reactor|Fusion Reactor]] that make electric energy out of plasma energy directly without needing steam or turbines, as a [[boiler|Fusion Reactor Boiler]] would. While more expensive and requiring [[perfluoromethyl|Perfluoromethyl]] cooling, they do have an innate +35% conversion bonus from TU to HE. In addition, the MHD turbine requires a minimum input of 5MTU/t of plasma energy to operate normally, otherwise efficiency will be halved.<br><br>Due to using plasma energy, MHDTs are affected by port sharing rules, meaning that having multiple connected MHDTs (or boilers) decreases the amount of energy each turbine gets, but overall increases the total amount extracted from the torus.<br><br>MHDTs do in fact not have any moving parts, instead the large rotating copper wheel is part of its cooling system. Ya dweeb.",
		"ru_RU": "Продвинутый компонент [[термоядерного реактора|Fusion Reactor]], который извлекает электричество из энергии плазмы напрямую, без использования вспомогательных процессов (вроде нагрева воды и прогона пара через паровые турбины). Дороговизна и необходимость в охлаждении [[перфторметаном|Perfluoromethyl]] окупаются безупречными значениями эффективности (135%). В дополнение следует сказать, что турбине необходима мощность не менее 5 MTU/с энергии плазмы, иначе эффективность механизма снизится вдвое.<br><br>Поскольку турбина использует энергию плазмы, на неё распространяется правило совместного использования портов: если к тору подключено сразу несколько бойлеров или турбин, каждый из потребителей по отдельности получит меньше энергии, хотя от самого тора суммарно энергии будет отведено больше.<br><br>МГДТ вообще-то почти не имеют подвижных запчастей, а большой вращающийся медный маховик является частью системы охлаждения. Да, душнила. :nerd:"
	}
}
