{
	"name": "Fusion Reactor Vessel",
	"icon": ["hbm:tile.fusion_torus", 1, 0],
	"trigger": [["hbm:tile.fusion_torus"]],
	"title": {
		"en_US": "Fusion Reactor Vessel",
		"ru_RU": "Основная камера",
		"zh_CN": "聚变反应堆容器"
	},
	"content": {
		"en_US": "\"Torus\", main component of the [[fusion reactor|Fusion Reactor]], uses fuel and energy from a [[klystron|Klystron]] to generate plasma. Also requires electricity and cooling via [[perfluoromethyl|Perfluoromethyl]] to operate.<br><br>Features four connection ports for external components. Devices that use plasma energy (and not just neutron flux) split the total output, a single component will receive 100% of the energy, two components will receive 62.5% each and three components get 50% each. Therefore, using multiple [[boilers|Fusion Reactor Boiler]] or [[MHDTs|MHD Turbine]] increases the total energy output, although with diminishing returns. Flux levels are not affected when shared, the output remains steady across all ports no matter how many attachments are used.<br><br>Both the buffered electric charge and fuel levels determine working speed, if either is below 50%, the reactor will start to throttle, burning slower and decreasing output energy. The klystron energy does not affect processing speed, too little energy will simply fail to ignite the plasma, and more energy will not accelerate the reaction.",
		"ru_RU": "Главный компонент [[термоядерного реактора|Fusion Reactor]]. Генерирует плазму, используя энергию [[клистрона|Klystron]] и топливо. Требует электричество и охлаждение [[перфторметаном|Perfluoromethyl]].<br><br>Имеет четыре порта для подключения внешних компонентов. Если имеются несколько устройств, одновременно потребляющих энергию плазмы (вроде турбин или бойлеров), то энергия будет распределяться так, что единственный потребитель получит 100% энергии, каждый из двух механизмов будет получать по 62.5% исходного количества, а каждый из трёх - по 50%. Да, использование нескольких [[бойлеров|Fusion Reactor Boiler]] или [[МГДТ|MHD Turbine]] увеличивает суммарное количество выходной энергии. Это и есть правило совместного использования портов. На поток нейтронов оно не распространяется – поток будет постоянен вне зависимости от количества потребителей.<br><br>И уровень энергии в буфере, и запас топлива влияют на скорость работы реактора: если какой-либо из показателей будет ниже 50%, реактор начнёт глохнуть, т.е. снизится скорость сгорания плазмы и выход энергии. Работа клистрона не влияет на скорость процесса: плазма просто не воспламенится, если энергии будет слишком мало, а излишнее её количество не ускорит реакцию.",
		"zh_CN": "“环形容器”是[[聚变反应堆|Fusion Reactor]]的核心部件，利用燃料和[[速调管|Klystron]]提供的能量产生等离子体。工作时还需要电能和[[四氟甲烷|Perfluoromethyl]]提供的冷却。<br><br>环形容器包含四个用于连接其他部件的端口。使用等离子体能量的部件（不包 括只使用中子通量的部件）会在彼此之间分配能量，只有一个部件时可以接收 100%的能量，有两个部件时每个部件分别接收62.5%的能量，有三个 部件时则是每个接收50%能量。因此，使用多个[[反应堆锅炉|Fusion Reactor Boiler]]或者[[磁流体涡轮|MHD Turbine]]时，尽管单个部件的效率有所降低，但总能量输出会提升。中子通量不受上述 机制影响，无论放置多少个部件，每个端口输出的中子通量都是一定的。<br><br>反应堆的工作速度同时取决于环形容器的能量缓存和燃料缓存，其中任意一个 低于50%时反应堆功率就会受限，降低燃烧速率和能量输出。速调管能量 不会影响反应速率，能量过低时反应完全不会发生，能量超过需求时反应也 不会加速。"
	}
}
